In [1]:
import pandas as pd

In [4]:
a = {
    "id": [1,2,3,4,5,6,7,8,9] , 
    "Name" : ['Rahul' , 'Sam' , 'Gorav' , 'Kriti' , 'Pooja' , 'Mohit' , 'Akshay' , 'Uday' , 'Manish'],
    "Department": ['Sales' , 'HR','Sales' , 'Management' , 'HR' , 'HR' , 'Sales' , 'Management' , 'HR'],
    "Salary" : [25000 , 30000 , 27000 , 42000 , 35000 ,32000 , 31000 , 50000 , 48000]
}

In [5]:
a

{'id': [1, 2, 3, 4, 5, 6, 7, 8, 9],
 'Name': ['Rahul',
  'Sam',
  'Gorav',
  'Kriti',
  'Pooja',
  'Mohit',
  'Akshay',
  'Uday',
  'Manish'],
 'Department': ['Sales',
  'HR',
  'Sales',
  'Management',
  'HR',
  'HR',
  'Sales',
  'Management',
  'HR'],
 'Salary': [25000, 30000, 27000, 42000, 35000, 32000, 31000, 50000, 48000]}

In [6]:
df = pd.DataFrame(a) 
df

   id    Name  Department  Salary
0   1   Rahul       Sales   25000
1   2     Sam          HR   30000
2   3   Gorav       Sales   27000
3   4   Kriti  Management   42000
4   5   Pooja          HR   35000
5   6   Mohit          HR   32000
6   7  Akshay       Sales   31000
7   8    Uday  Management   50000
8   9  Manish          HR   48000

In [7]:
df.head()

   id   Name  Department  Salary
0   1  Rahul       Sales   25000
1   2    Sam          HR   30000
2   3  Gorav       Sales   27000
3   4  Kriti  Management   42000
4   5  Pooja          HR   35000

In [8]:
df.head(3)

   id   Name Department  Salary
0   1  Rahul      Sales   25000
1   2    Sam         HR   30000
2   3  Gorav      Sales   27000

In [9]:
df.tail()

   id    Name  Department  Salary
4   5   Pooja          HR   35000
5   6   Mohit          HR   32000
6   7  Akshay       Sales   31000
7   8    Uday  Management   50000
8   9  Manish          HR   48000

In [10]:
df.tail(3)

   id    Name  Department  Salary
6   7  Akshay       Sales   31000
7   8    Uday  Management   50000
8   9  Manish          HR   48000

In [20]:
df.sample(3)

   id    Name  Department  Salary
6   7  Akshay       Sales   31000
1   2     Sam          HR   30000
3   4   Kriti  Management   42000

In [21]:
df.describe()

             id        Salary
count  9.000000      9.000000
mean   5.000000  35555.555556
std    2.738613   9043.106644
min    1.000000  25000.000000
25%    3.000000  30000.000000
50%    5.000000  32000.000000
75%    7.000000  42000.000000
max    9.000000  50000.000000

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          9 non-null      int64
 1   Name        9 non-null      object
 2   Department  9 non-null      object
 3   Salary      9 non-null      int64
dtypes: int64(2), object(2)
memory usage: 416.0+ bytes

In [23]:
df.dtypes

id             int64
Name          object
Department    object
Salary         int64
dtype: object

In [25]:
# !pip install pandas

In [26]:
df.to_csv("EmployeeNewSal.csv")

In [27]:
df.to_csv("EmployeeNewSalSecond.csv" , index = False)

In [34]:
# df = pd.read_csv('Path of your file') 

df = pd.read_csv('C:\\Users\\saurabh\\Desktop\\pyth\\newplacementdata.csv')

In [35]:
df

     cgpa  placement_exam_marks  placed
0    7.19                    26       1
1    7.46                    38       1
2    7.54                    40       1
3    6.42                     8       1
4    7.23                    17       0
..    ...                   ...     ...
995  8.87                    44       1
996  9.12                    65       1
997  4.89                    34       0
998  8.62                    46       1
999  4.90                    10       1

[1000 rows x 3 columns]

In [36]:
df.columns

Index(['cgpa', 'placement_exam_marks', 'placed'], dtype='object')

In [37]:
df['cgpa']

0      7.19
1      7.46
2      7.54
3      6.42
4      7.23
       ...
995    8.87
996    9.12
997    4.89
998    8.62
999    4.90
Name: cgpa, Length: 1000, dtype: float64

In [38]:
df['placed']

0      1
1      1
2      1
3      1
4      0
      ..
995    1
996    1
997    0
998    1
999    1
Name: placed, Length: 1000, dtype: int64

In [39]:
df.head(2)

   cgpa  placement_exam_marks  placed
0  7.19                    26       1
1  7.46                    38       1

In [41]:
df['cgpa'][0]

7.19

In [42]:
df['cgpa'][0] = 8.45

C:\Users\saurabh\AppData\Local\Temp\ipykernel_14144\3362703441.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['cgpa'][0] = 8.45

In [43]:
df.head(2)

   cgpa  placement_exam_marks  placed
0  8.45                    26       1
1  7.46                    38       1

In [44]:
a = {
    "id": [1,2,3,4,5,6,7,8,9] , 
    "Name" : ['Rahul' , 'Sam' , 'Gorav' , 'Kriti' , 'Pooja' , 'Mohit' , 'Akshay' , 'Uday' , 'Manish'],
    "Department": ['Sales' , 'HR','Sales' , 'Management' , 'HR' , 'HR' , 'Sales' , 'Management' , 'HR'],
    "Salary" : [25000 , 30000 , 27000 , 42000 , 35000 ,32000 , 31000 , 50000 , 48000]
}

In [46]:
df = pd.DataFrame(a) 
df

   id    Name  Department  Salary
0   1   Rahul       Sales   25000
1   2     Sam          HR   30000
2   3   Gorav       Sales   27000
3   4   Kriti  Management   42000
4   5   Pooja          HR   35000
5   6   Mohit          HR   32000
6   7  Akshay       Sales   31000
7   8    Uday  Management   50000
8   9  Manish          HR   48000

In [49]:
df['Name'][0] = "Prem"

C:\Users\saurabh\AppData\Local\Temp\ipykernel_14144\836656362.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][0] = "Prem"

In [50]:
df

   id    Name  Department  Salary
0   1    Prem       Sales   25000
1   2     Sam          HR   30000
2   3   Gorav       Sales   27000
3   4   Kriti  Management   42000
4   5   Pooja          HR   35000
5   6   Mohit          HR   32000
6   7  Akshay       Sales   31000
7   8    Uday  Management   50000
8   9  Manish          HR   48000

# loc and iloc

In [51]:
a = df.loc[4:7 , "Name"] 
a

4     Pooja
5     Mohit
6    Akshay
7      Uday
Name: Name, dtype: object

In [52]:
a = df.iloc[4:7 , 1:4] 
a

     Name Department  Salary
4   Pooja         HR   35000
5   Mohit         HR   32000
6  Akshay      Sales   31000

In [54]:
import numpy as np

In [61]:
df['Working_hours'] = np.random.randint(1,7,9)

In [63]:
df = df.drop(columns = ['Working hours'] , axis = 1)

In [64]:
df

   id    Name  Department  Salary  Working_hours
0   1    Prem       Sales   25000              2
1   2     Sam          HR   30000              5
2   3   Gorav       Sales   27000              4
3   4   Kriti  Management   42000              1
4   5   Pooja          HR   35000              4
5   6   Mohit          HR   32000              4
6   7  Akshay       Sales   31000              5
7   8    Uday  Management   50000              2
8   9  Manish          HR   48000              1

In [65]:
df = df.drop(columns = ['Working_hours'] , axis = 1)

In [66]:
df

   id    Name  Department  Salary
0   1    Prem       Sales   25000
1   2     Sam          HR   30000
2   3   Gorav       Sales   27000
3   4   Kriti  Management   42000
4   5   Pooja          HR   35000
5   6   Mohit          HR   32000
6   7  Akshay       Sales   31000
7   8    Uday  Management   50000
8   9  Manish          HR   48000

In [67]:
df['Salary'].max()

50000

In [68]:
df['Salary'].min()

25000

In [70]:
df['Salary'].count()

9

In [71]:
df.count()

id            9
Name          9
Department    9
Salary        9
dtype: int64